{
  "auto_mapping": null,
  "base_model_name_or_path": "qwen-pretrain",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 256,
  "lora_dropout": 0.05,
  "modules_to_save": [
    "wte",
    "lm_head"
  ],
  "peft_type": "LORA",
  "r": 128,
  "revision": null,
  "target_modules": [
    "c_attn",
    "attn.c_proj",
    "w1",
    "w2"
  ],
  "task_type": "CAUSAL_LM"
}