{
  "metadata": {
    "total_size": 23379412480
  },
  "weight_map": {
    "lm_head.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.h.0.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.0.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.0.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.0.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.0.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.0.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.0.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.0.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.1.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.1.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.1.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.1.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.1.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.1.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.1.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.1.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.10.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.10.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.10.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.10.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.10.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.10.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.10.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.10.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.11.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.11.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.11.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.11.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.11.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.11.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.11.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.11.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.12.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.12.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.12.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.12.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.12.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.12.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.12.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.12.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.13.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.13.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.13.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.13.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.13.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.13.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.13.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.13.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.14.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.14.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.14.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.14.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.14.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.14.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.14.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.14.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.15.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.15.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.15.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.15.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.15.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.15.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.15.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.15.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.16.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.16.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.16.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.16.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.16.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.16.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.16.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.16.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.17.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.17.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.17.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.17.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.17.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.17.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.17.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.17.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.18.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.18.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.18.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.18.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.18.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.18.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.18.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.18.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.19.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.19.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.19.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.19.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.19.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.19.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.19.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.19.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.2.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.2.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.2.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.2.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.2.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.2.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.2.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.2.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.20.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.20.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.20.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.20.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.20.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.20.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.20.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.20.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.21.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.21.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.21.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.21.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.21.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.21.mlp.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.21.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.21.mlp.w2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.22.attn.c_attn.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.h.22.attn.c_attn.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.22.attn.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.22.ln_1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.22.ln_2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.22.mlp.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.22.mlp.w1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.22.mlp.w2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.23.attn.c_attn.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.h.23.attn.c_attn.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.23.attn.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.23.ln_1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.23.ln_2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.23.mlp.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.23.mlp.w1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.23.mlp.w2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.24.attn.c_attn.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.h.24.attn.c_attn.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.24.attn.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.24.ln_1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.24.ln_2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.24.mlp.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.24.mlp.w1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.24.mlp.w2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.25.attn.c_attn.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.h.25.attn.c_attn.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.25.attn.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.25.ln_1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.25.ln_2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.25.mlp.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.25.mlp.w1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.25.mlp.w2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.26.attn.c_attn.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.h.26.attn.c_attn.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.26.attn.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.26.ln_1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.26.ln_2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.26.mlp.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.26.mlp.w1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.26.mlp.w2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.27.attn.c_attn.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.h.27.attn.c_attn.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.27.attn.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.27.ln_1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.27.ln_2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.27.mlp.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.27.mlp.w1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.27.mlp.w2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.28.attn.c_attn.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.h.28.attn.c_attn.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.28.attn.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.28.ln_1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.28.ln_2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.28.mlp.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.28.mlp.w1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.28.mlp.w2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.29.attn.c_attn.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.h.29.attn.c_attn.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.29.attn.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.29.ln_1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.29.ln_2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.29.mlp.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.29.mlp.w1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.29.mlp.w2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.3.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.3.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.3.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.3.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.3.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.3.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.3.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.3.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.30.attn.c_attn.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.h.30.attn.c_attn.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.30.attn.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.30.ln_1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.30.ln_2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.30.mlp.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.30.mlp.w1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.30.mlp.w2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.31.attn.c_attn.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.h.31.attn.c_attn.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.31.attn.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.31.ln_1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.31.ln_2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.31.mlp.c_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.31.mlp.w1.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.31.mlp.w2.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.h.4.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.4.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.4.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.4.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.4.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.4.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.4.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.4.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.5.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.5.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.5.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.5.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.5.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.5.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.5.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.5.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.6.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.6.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.6.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.6.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.6.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.6.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.6.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.6.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.7.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.7.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.7.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.7.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.7.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.7.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.7.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.7.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.8.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.8.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.8.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.8.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.8.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.8.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.8.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.8.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.9.attn.c_attn.bias": "pytorch_model-00001-of-00003.bin",
    "transformer.h.9.attn.c_attn.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.9.attn.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.9.ln_1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.9.ln_2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.9.mlp.c_proj.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.9.mlp.w1.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.h.9.mlp.w2.weight": "pytorch_model-00001-of-00003.bin",
    "transformer.ln_f.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.visual.attn_pool.attn.in_proj_bias": "pytorch_model-00002-of-00003.bin",
    "transformer.visual.attn_pool.attn.in_proj_weight": "pytorch_model-00002-of-00003.bin",
    "transformer.visual.attn_pool.attn.out_proj.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.visual.attn_pool.attn.out_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.visual.attn_pool.kv_proj.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.visual.attn_pool.ln_kv.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.visual.attn_pool.ln_kv.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.visual.attn_pool.ln_q.bias": "pytorch_model-00002-of-00003.bin",
    "transformer.visual.attn_pool.ln_q.weight": "pytorch_model-00002-of-00003.bin",
    "transformer.visual.attn_pool.pos_embed": "pytorch_model-00002-of-00003.bin",
    "transformer.visual.attn_pool.query": "pytorch_model-00002-of-00003.bin",
    "transformer.visual.clip_model.vision_model.embeddings.class_embedding": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.embeddings.patch_embedding.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.embeddings.position_embedding.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.0.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.1.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.10.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.11.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.12.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.13.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.14.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.15.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.16.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.17.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.18.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.19.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.2.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.self_attn.q_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.self_attn.q_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.self_attn.v_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.20.self_attn.v_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.21.layer_norm1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.21.layer_norm1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.21.layer_norm2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.21.layer_norm2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.21.mlp.fc1.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.21.mlp.fc1.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.21.mlp.fc2.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.21.mlp.fc2.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.21.self_attn.k_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.21.self_attn.k_proj.weight": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.21.self_attn.out_proj.bias": "pytorch_model-00003-of-00003.bin",
    "transformer.visual.clip_model.vision_model.encoder.layers.21.self_attn.out_proj.weight": "pytorch_model-00003-of-00003.bin",
